english/charge.md

# Table of Contents

-   [语义](#org083bd2b)
-   [短语](#org85efa83)

被指控攻击的价钱太贵


<a id="org083bd2b"></a>

# 语义


## 价钱

There is a charge for the use of the swimming pool.


## 负责

He asked to speak to the person in charge.


## 由某人照料

The files were left in your charge.


## 指控

He was found guilty of all six charges against him.


## 指责

Wallace denied charges that he had lied to investigators.


## 电量

Leave the battery on charge all night.


## 冲击力

Cases of child abuse have a strong emotional charge.


## 开价

The hotel charges $125 a night.


## 猛冲

The boys charged noisily into the water.


## 进攻

Then, with a final effort, our men charged the enemy for the last time.


## 使充电

The shaver can be charged up.


<a id="org85efa83"></a>

# 短语


## in charge of

Stern put Travis in charge of the research team.

<https://youglish.com/getbyid/132686935/in%20charge%20of/english>


## on a charge

The following morning, he was arrested on a charge of burglary.

<https://youglish.com/getbyid/21626487/on%20a%20charge/english>


## lead the charge

It was small businesses that led the charge against health care changes.

<https://youglish.com/getbyid/65924968/lead%20the%20charge/english>


## get a charge out of something

I got a real charge out of seeing my niece take first steps.

<https://youglish.com/getbyid/118419325/get%20a%20charge%20out%20of/english>


## charge to

The old servant fulfilled his master's charge to care for the children.

<https://youglish.com/getbyid/75087871/charge%20to/english>


## charge something to somebody's room

Wilson charged the drinks to his room.


## charge with

Gibbons has been charged with murder.

<https://youglish.com/getbyid/15681280/charge%20with/english>


## charge that

Demonstrators have charged that the police used excessive force against them.

<https://youglish.com/getbyid/4224698/charge%20that/english>


## charge somebody with

The commission is charged with investigating war crimes.
